---
kind: method
id: M:Autodesk.Revit.DB.SlabShapeEditor.Dispose
source: html/093f82df-0da1-1021-1991-83094bc2f19d.htm
---
# Autodesk.Revit.DB.SlabShapeEditor.Dispose Method

Releases all resources used by the SlabShapeEditor

## Syntax (C#)
```csharp
public void Dispose()
```